In [1]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [2]:
password = getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost:3306/bank'
engine = create_engine(connection_string)

## 1. How many distinct (different) actors' last names are there?

In [9]:
query='''SELECT COUNT(DISTINCT last_name) AS "Number of different Last Names" FROM sakila.actor'''
data_actor = pd.read_sql_query(query, engine)
data_actor.head()

   Number of different Last Names
0                             121

## 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [40]:
query = '''SELECT *, 
CASE 
WHEN SUBSTRING(CONVERT(rental_date, FLOAT), 6, 1) = '6' OR SUBSTRING(CONVERT(rental_date, FLOAT), 6, 1) = 7 THEN 'weekend'
ELSE 'workday'
END AS day_type
 FROM sakila.rental'''
data_rental = pd.read_sql_query(query, engine)
data_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,workday

## 3. Get all films with ARMAGEDDON in the title.

In [28]:
query='''SELECT title from sakila.film where title like "%%ARMAGEDDON%%"'''
data_film = pd.read_sql_query(query, engine)
data_film.head()

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

## 4. Get 10 the longest films.

In [32]:
query='''SELECT title, length from sakila.film order by length DESC limit 10 '''
data_length = pd.read_sql_query(query, engine)
data_length.head(10)

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

## 5. How many films include Behind the Scenes content?

In [34]:
query='''SELECT title, special_features from sakila.film where special_features like "%%behind%%"'''
data_special = pd.read_sql_query(query, engine)
data_special.head(10)

                 title                               special_features
0     ACADEMY DINOSAUR               Deleted Scenes,Behind the Scenes
1     AFFAIR PREJUDICE                 Commentaries,Behind the Scenes
2      ALAMO VIDEOTAPE                 Commentaries,Behind the Scenes
3          ALI FOREVER               Deleted Scenes,Behind the Scenes
4       ALICE FANTASIA      Trailers,Deleted Scenes,Behind the Scenes
5         ALIEN CENTER        Trailers,Commentaries,Behind the Scenes
6           ALONE TRIP                     Trailers,Behind the Scenes
7        ALTER VICTORY                     Trailers,Behind the Scenes
8         AMADEUS HOLY  Commentaries,Deleted Scenes,Behind the Scenes
9  AMELIE HELLFIGHTERS  Commentaries,Deleted Scenes,Behind the Scenes

## 6 Which kind of movies (rating) have a mean duration of more than two hours?

In [47]:
query='''SELECT AVG(length) AS 'Mean Duration', rating
from sakila.film
GROUP BY rating
HAVING AVG(length)>120'''
data_special = pd.read_sql_query(query, engine)
data_special.head(10)

   Mean Duration rating
0       120.4439  PG-13

## 7 Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [52]:
# Ranking by creating a standard

query='''SELECT title, length,
  CASE 
    WHEN length>=150 THEN 'Super Long Movie'
    WHEN length BETWEEN 150 AND 110 THEN 'Long Movie'
    WHEN length BETWEEN 60 AND 109 THEN 'Standard Movie' 
    ELSE 'Short Movie'
  END AS 'Length Rank'
  FROM sakila.film
  WHERE length IS NOT NULL AND length != 0
  ORDER BY length DESC'''
data_rank = pd.read_sql_query(query, engine)
data_rank.head(30)

                 title  length       Length Rank
0        CHICAGO NORTH     185  Super Long Movie
1       CONTROL ANTHEM     185  Super Long Movie
2       DARN FORRESTER     185  Super Long Movie
3          GANGS PRIDE     185  Super Long Movie
4            HOME PITY     185  Super Long Movie
5        MUSCLE BRIGHT     185  Super Long Movie
6         POND SEATTLE     185  Super Long Movie
7   SOLDIERS EVOLUTION     185  Super Long Movie
8    SWEET BROTHERHOOD     185  Super Long Movie
9         WORST BANGER     185  Super Long Movie
10   CONSPIRACY SPIRIT     184  Super Long Movie
11    CRYSTAL BREAKING     184  Super Long Movie
12      KING EVOLUTION     184  Super Long Movie
13     MOONWALKER FOOL     184  Super Long Movie
14     SMOOCHY CONTROL     184  Super Long Movie
15      SONS INTERVIEW     184  Super Long Movie
16      SORORITY QUEEN     184  Super Long Movie
17      THEORY MERMAID     184  Super Long Movie
18       CATCH AMISTAD     183  Super Long Movie
19      FRONTIER CABIN     183  Super Long Movie
20       SCALAWAG DUCK     183  Super Long Movie
21           WIFE TURN     183  Super Long Movie
22      YOUNG LANGUAGE     183  Super Long Movie
23     BAKED CLEOPATRA     182  Super Long Movie
24       MONSOON CAUSE     182  Super Long Movie
25       RECORDS ZORRO     182  Super Long Movie
26          REDS POCUS     182  Super Long Movie
27         SATURN NAME     182  Super Long Movie
28      SEARCHERS WAIT     182  Super Long Movie
29    ANALYZE HOOSIERS     181  Super Long Movie

In [51]:
# Ranking using the rank function
query="SELECT Title, Length, RANK() OVER (ORDER BY Length DESC) AS 'Rank' FROM sakila.film WHERE Length IS NOT NULL AND Length > 0;"
data = pd.read_sql_query(query, engine)
data.head(30)

                 Title  Length  Rank
0        CHICAGO NORTH     185     1
1       CONTROL ANTHEM     185     1
2       DARN FORRESTER     185     1
3          GANGS PRIDE     185     1
4            HOME PITY     185     1
5        MUSCLE BRIGHT     185     1
6         POND SEATTLE     185     1
7   SOLDIERS EVOLUTION     185     1
8    SWEET BROTHERHOOD     185     1
9         WORST BANGER     185     1
10   CONSPIRACY SPIRIT     184    11
11    CRYSTAL BREAKING     184    11
12      KING EVOLUTION     184    11
13     MOONWALKER FOOL     184    11
14     SMOOCHY CONTROL     184    11
15      SONS INTERVIEW     184    11
16      SORORITY QUEEN     184    11
17      THEORY MERMAID     184    11
18       CATCH AMISTAD     183    19
19      FRONTIER CABIN     183    19
20       SCALAWAG DUCK     183    19
21           WIFE TURN     183    19
22      YOUNG LANGUAGE     183    19
23     BAKED CLEOPATRA     182    24
24       MONSOON CAUSE     182    24
25       RECORDS ZORRO     182    24
26          REDS POCUS     182    24
27         SATURN NAME     182    24
28      SEARCHERS WAIT     182    24
29    ANALYZE HOOSIERS     181    30